app/controllers/companies_controller.rb

  def index
    @companies = Company.order('companies.name ASC').all
---
SELECT "companies".* FROM "companies"
SELECT COUNT(*) FROM "companies"